print('***************************************************')
print('******승제의 ATM기에 오신것을 환영합니다 ^^********')
print('***************************************************\n\n')

num = 12345678987
balance = 100000
temp = int(input("계좌번호 입력: "))
if temp == num :
    print('\n\n***************************************************')
    print('계좌번호가 일치합니다!')
    print('***************************************************\n')
    print('***************************************************')
    print('업무내용 : 인출=1, 입금=2, 잔액조회=3')
    case = int(input('어떤 업무를 수행하실 것 인가요? : '))
    print('***************************************************\n\n')

    if case == 1 :
        withdraw = int(input("얼마 인출 할거냐??: "))
        balance = balance - withdraw
        print(f'인출이 완료되었습니다. 현재잔액 :{balance}')
    elif case == 2 :
        deposit = int(input("얼마 입금 할거냐??: "))
        balance = balance + deposit
        print(f"입금완료 ㅋ \n 현재 잔액: {balance}")
    elif case == 3 :
        print(balance)
    else :
        print('종료합니다.')
else :
    print('***************************************************')
    print('계좌번호가 틀렸습니다 ㅋ')
    print('***************************************************\n')